# -*- coding: utf-8 -*-
"""
Created on Fri Feb  9 12:51:44 2018

@author: Administrator
"""
import numpy as np 

def sigmoid(x):
    return 1 /(1 + np.exp(-x))

총에러들=[]

def 학습하다(신경망, x, 실제값):
    #순전파
    _1층출력들 = sigmoid(np.dot(x, 신경망['가중치1층']))
    _2층출력들 = sigmoid(np.dot(_1층출력들, 신경망['가중치2층']))
    
    #에러 구하기
    _2층에러들 = 실제값 - _2층출력들    
    _1층에러들 = np.dot(신경망['가중치2층'], _2층에러들)#역전파에 의한 에러구하기
    
    #시각화용{
    global 총에러
    총에러들.append(np.sum(np.square(_2층에러들)))
    print('총에러:', 총에러들[-1])
    #시각화용}
    
    #(가중치변화에대한)에러변화율 구하기
    가중치변화에대한에러변화율들 = {}    
    행렬화2_1=np.array(_1층출력들, ndmin=2).T
    행렬화2_2=np.array(_2층에러들*_2층출력들*(1.0 - _2층출력들), ndmin=2)
    가중치변화에대한에러변화율들['가중치2층'] = np.dot(행렬화2_1, 행렬화2_2)    
    
    행렬화1_1=np.array(x, ndmin=2).T
    행렬화1_2=np.array((_1층에러들*_1층출력들*(1.0 - _1층출력들)), ndmin=2)
    가중치변화에대한에러변화율들['가중치1층'] = np.dot(행렬화1_1, 행렬화1_2)
    
    #가중치 갱신 (by 가중치변화에대한에러변화율들 이용)
    학습율=0.03
    신경망['가중치2층'] += 학습율 * 가중치변화에대한에러변화율들['가중치2층']
    신경망['가중치1층'] += 학습율 * 가중치변화에대한에러변화율들['가중치1층']  
  
def 예측하다(신경망, x):
    _1층출력들 = sigmoid(np.dot(x, 신경망['가중치1층']))
    _2층출력들 = sigmoid(np.dot(_1층출력들, 신경망['가중치2층']))    
    return _2층출력들
 
#========학습==================
print('========학습============')
#0.학습데이터 준비
xs = np.array(  [[1,1,1,1,1,
                  1,0,0,0,1,
                  1,0,0,0,1,
                  1,0,0,0,1,
                  1,1,1,1,1],
                 [0,0,1,0,0,
                  0,0,1,0,0,
                  0,0,1,0,0,
                  0,0,1,0,0,
                  0,0,1,0,0],
                 [1,1,1,1,1,
                  0,0,0,0,1,
                  1,1,1,1,1,
                  1,0,0,0,0,
                  1,1,1,1,1],
                 [1,1,1,1,1,
                  0,0,0,0,1,
                  1,1,1,1,1,
                  0,0,0,0,1,
                  1,1,1,1,1],
                 [1,0,0,0,1,
                  1,0,0,0,1,
                  1,1,1,1,1,
                  0,0,0,0,1,
                  0,0,0,0,1],
                 [1,1,1,1,1,
                  1,0,0,0,0,
                  1,1,1,1,1,
                  0,0,0,0,1,
                  1,1,1,1,1],
                 [1,0,0,0,0,
                  1,0,0,0,0,
                  1,1,1,1,1,
                  1,0,0,0,1,
                  1,1,1,1,1],
                 [1,1,1,1,1,
                  0,0,0,0,1,
                  0,0,0,0,1,
                  0,0,0,0,1,
                  0,0,0,0,1],
                 [1,1,1,1,1,
                  1,0,0,0,1,
                  1,1,1,1,1,
                  1,0,0,0,1,
                  1,1,1,1,1],
                 [1,1,1,1,1,
                  1,0,0,0,1,
                  1,1,1,1,1,
                  0,0,0,0,1,
                  0,0,0,0,1]])
    
ts =np.array(   [[1,0,0,0,0,0,0,0,0,0],
                 [0,1,0,0,0,0,0,0,0,0],
                 [0,0,1,0,0,0,0,0,0,0],
                 [0,0,0,1,0,0,0,0,0,0],
                 [0,0,0,0,1,0,0,0,0,0],
                 [0,0,0,0,0,1,0,0,0,0],
                 [0,0,0,0,0,0,1,0,0,0],
                 [0,0,0,0,0,0,0,1,0,0],
                 [0,0,0,0,0,0,0,0,1,0],
                 [0,0,0,0,0,0,0,0,0,1]])
    
#1.초기화    
입력층크기 = 25
은닉층크기 = 50
출력층크기 = 10   
np.random.seed(0)
신경망 ={}
신경망['가중치1층'] = np.random.randn(입력층크기,은닉층크기)
신경망['가중치2층'] = np.random.randn(은닉층크기,출력층크기)

#2.학습 - 학습의 결과=신경망내 가중치들이 적절한 값을 가지게 는 것
for i in range(1000):
    for x, t in zip(xs, ts):
        학습하다(신경망, x, t)   
        
#========예측==================        
print('========예측1=============')       
for x, t in zip(xs, ts):
    print('예측:', np.argmax(예측하다(신경망, x)), '실제:', np.argmax(t))
   #print('예측:', 예측하다(신경망,x), '실제:',t)
print('========예측2=============')   
for index in np.random.choice(10, 10):
    print('예측:', np.argmax(예측하다(신경망, xs[index])), '실제:', np.argmax(ts[index]))  
    #print('예측:', 예측하다(신경망,xs[index]), '실제:',ts[index])
#========에러량 변화 시각화=================
from matplotlib import pyplot as plt

xs_ = [x for x in range(len(총에러들))]
ys_ = [총에러들[x] for x in xs_]

plt.rcParams["figure.figsize"] = (20,10)
plt.rcParams['lines.linewidth'] = 1
plt.rcParams['axes.grid'] = True 
plt.plot(xs_, ys_, 'r')
plt.title('Error Cost')
plt.ylabel('cost' )
plt.xlabel('training time' )
plt.show()
    